# 16_February_15th_Assignment

## Q1. What is a database? Differentiate between SQL and NoSQL databases.



### **What is a Database?**
### A **database** is an organized collection of data that is stored and accessed electronically. It allows for efficient storage, retrieval, and management of data. Databases are used to store structured information such as customer data, inventory data, transaction records, etc. They are managed by a **Database Management System (DBMS)**.

---

#### **Difference between SQL and NoSQL Databases:**

| **Feature**         | **SQL Databases (Relational)**                  | **NoSQL Databases (Non-relational)**            |
|---------------------|-------------------------------------------------|-------------------------------------------------|
| **Data Structure**   | Structured data stored in tables (rows and columns). | Unstructured or semi-structured data (JSON, BSON, key-value pairs). |
| **Schema**           | Fixed schema (schema must be defined before data is inserted). | Flexible schema (can store data without a predefined structure). |
| **Query Language**   | Uses **Structured Query Language (SQL)** for queries. | Varies (e.g., MongoDB uses its query language, or key-value retrieval in Redis). |
| **Scalability**      | Typically scales vertically (upgrading server hardware). | Scales horizontally (across multiple servers). |
| **Transactions**     | Supports **ACID** properties (Atomicity, Consistency, Isolation, Durability). | Limited support for ACID, often follows **BASE** (Basically Available, Soft state, Eventual consistency). |
| **Examples**         | MySQL, PostgreSQL, Oracle, SQL Server.          | MongoDB, CouchDB, Cassandra, Redis, DynamoDB.    |
| **Use Cases**        | Best suited for complex queries, data integrity, and structured data. | Best suited for large-scale applications, big data, and real-time applications. |

---

## **Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.**

### **What is DDL (Data Definition Language)?**

**DDL** is a subset of SQL used to define, modify, and delete database structures such as tables, indexes, and schemas. It does not deal with the manipulation of data but with the structure of the database itself.

### **Common DDL Commands and Their Use:**

1. **CREATE**:
   - **Purpose**: Used to create new database objects like tables, indexes, or databases.
   - **Example**: Create a table `students` with columns `id`, `name`, and `age`.

In [ ]:
CREATE TABLE students (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    age INT
);

2. **DROP**:
   - **Purpose**: Used to delete an existing database object such as a table or a database.
   - **Example**: Drop the `students` table from the database.

In [ ]:
DROP TABLE students;

3. **ALTER**:
   - **Purpose**: Used to modify an existing database object, such as adding, deleting, or modifying columns in a table.
   - **Example**: Add a new column `address` to the `students` table.

In [ ]:
ALTER TABLE students
ADD address VARCHAR(255);

4. **TRUNCATE**:
   - **Purpose**: Used to delete all rows in a table but keeps the structure of the table intact. It is more efficient than using `DELETE` for removing all rows because it does not log individual row deletions.
   - **Example**: Remove all data from the `students` table.

In [ ]:
TRUNCATE TABLE students;



### **Summary**

- **DDL** refers to SQL commands used to define and manage the structure of database objects.
- **CREATE** is used to create new objects.
- **DROP** is used to remove existing objects.
- **ALTER** is used to modify the structure of existing objects.
- **TRUNCATE** is used to delete all rows from a table without deleting the table itself.

## Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

### **DML** is a subset of SQL used for manipulating data within database objects (usually tables). DML commands allow you to add, modify, or delete data stored in the tables of a database.

### **Common DML Commands:**

1. **INSERT**:
   - **Purpose**: Used to add new rows of data into a table.
   - **Example**: Insert a new student into the `students` table.

In [ ]:
INSERT INTO students (id, name, age)
VALUES (1, 'John Doe', 20);

In above example, a new row with `id=1`, `name='John Doe'`, and `age=20` is added to the `students` table.

2. **UPDATE**:
   - **Purpose**: Used to modify the existing data in a table. You specify which row to update using a **WHERE** clause.
   - **Example**: Update the age of the student with `id=1` to 21.

In [ ]:
UPDATE students
SET age = 21
WHERE id = 1;

In above example, the `age` of the student with `id=1` is changed to 21.

3. **DELETE**:
   - **Purpose**: Used to remove one or more rows from a table. A **WHERE** clause is generally used to specify which rows to delete.
   - **Example**: Delete the student with `id=1` from the `students` table.

In [ ]:
DELETE FROM students
WHERE id = 1;

In this example, the row where `id=1` is deleted from the `students` table.

## Q4. What is DQL? Explain SELECT with an example.

### **What is DQL (Data Query Language)?**

**DQL** is a subset of SQL used for querying and retrieving data from the database. The most common DQL command is **SELECT**, which allows you to retrieve data based on specific criteria.

#### **SELECT Command:**

The **SELECT** statement is used to query a database and retrieve specific information. It can retrieve all or specific columns from one or more tables.

- **Basic Syntax**:

In [ ]:
SELECT column1, column2, ...
FROM table_name
WHERE condition;

#### **Example 1**: Retrieve all columns from the `students` table.

In [ ]:
SELECT * FROM students;

This retrieves all rows and all columns from the `students` table.

#### **Example 2**: Retrieve specific columns (`id` and `name`) from the `students` table.

In [ ]:
SELECT id, name FROM students;

This retrieves only the `id` and `name` columns from the `students` table.

#### **Example 3**: Retrieve data with a condition (students who are 20 years old).

In [ ]:
SELECT * FROM students
WHERE age = 20;

This retrieves all columns for students whose age is 20.

#### **Example 4**: Retrieve data and sort the result by age in ascending order.

In [ ]:
SELECT * FROM students
ORDER BY age ASC;

This retrieves all columns from the `students` table, sorted by the `age` column in ascending order.

#### **Example 5**: Retrieve data and limit the result to the top 3 students.

In [ ]:
SELECT * FROM students
LIMIT 3;

This retrieves only the first 3 rows from the `students` table.

---

### **Summary of DML and DQL**

- **DML (Data Manipulation Language)**: Used to modify data in the database (INSERT, UPDATE, DELETE).
  - **INSERT**: Adds new rows of data.
  - **UPDATE**: Modifies existing rows of data.
  - **DELETE**: Removes rows of data.
  
- **DQL (Data Query Language)**: Used to query and retrieve data from the database (SELECT).
  - **SELECT**: Retrieves data based on specific criteria or conditions.

## Q5. Explain Primary Key and Foreign Key.

### **Primary Key:**

A **Primary Key** is a column (or a combination of columns) in a table that uniquely identifies each row in that table. Each value in the primary key must be unique and not null. It ensures the integrity and uniqueness of the data within a table. A table can have only one primary key.

- **Properties of Primary Key**:
  - Uniqueness: Each record must have a unique value in the primary key column.
  - Non-null: The primary key column cannot have NULL values.
  - Uniquely identifies records: No two rows can have the same value for the primary key.

- **Example**: Consider a `students` table with the following structure:

In [ ]:
CREATE TABLE students (
    student_id INT PRIMARY KEY,
    name VARCHAR(100),
    age INT
);

  In this example, `student_id` is the primary key, which ensures that each student has a unique identifier.

---

#### **Foreign Key:**

A **Foreign Key** is a column (or a combination of columns) in one table that refers to the primary key in another table. It establishes a relationship between the two tables and ensures referential integrity, meaning that the values in the foreign key column must match values in the primary key column of the related table, or be NULL.

- **Properties of Foreign Key**:
  - It is used to establish and enforce a link between the data in two tables.
  - The foreign key column may have duplicate values and may be NULL.
  - It ensures that the data in the child table is valid according to the parent table.

- **Example**: Consider two tables `students` and `enrollments`. `students` has a primary key `student_id`, and `enrollments` has a foreign key that references `student_id` in `students`.

In [ ]:
CREATE TABLE students (
    student_id INT PRIMARY KEY,
    name VARCHAR(100),
    age INT
);

CREATE TABLE enrollments (
    enrollment_id INT PRIMARY KEY,
    student_id INT,
    course_name VARCHAR(100),
    FOREIGN KEY (student_id) REFERENCES students(student_id)
);

  In this example, `student_id` in the `enrollments` table is a foreign key that refers to the `student_id` in the `students` table. This ensures that only students who exist in the `students` table can be enrolled in courses.

## **Q6. Write a Python Code to Connect MySQL to Python. Explain the `cursor()` and `execute()` Method.**

#### **Python Code to Connect MySQL to Python:**

To connect Python with MySQL, you will need to install the **mysql-connector** library and use it to establish a connection. Below is an example code for connecting to a MySQL database and performing a query:

In [ ]:
import mysql.connector

# Establish a connection to the MySQL database
conn = mysql.connector.connect(
    host="localhost",      # The host where your MySQL server is running (localhost or IP address)
    user="root",           # Your MySQL username
    password="password",   # Your MySQL password
    database="test_db"     # The database to connect to
)

# Create a cursor object using the cursor() method
cursor = conn.cursor()

# Execute a query using the execute() method
cursor.execute("SELECT * FROM students")

# Fetch and print the result of the query
result = cursor.fetchall()
for row in result:
    print(row)

# Close the cursor and connection
cursor.close()
conn.close()

#### **Explanation of `cursor()` and `execute()` Methods:**

1. **cursor() Method:**
   - The `cursor()` method is used to create a cursor object, which is used to interact with the MySQL database. It allows you to execute SQL queries and fetch data from the database.
   - **Example**: `cursor = conn.cursor()` creates a cursor object that is used to perform operations like executing queries.

2. **execute() Method:**
   - The `execute()` method is used to execute a single SQL query. It sends the query to the database for execution. After execution, you can use methods like `fetchall()` or `fetchone()` to retrieve the result of the query.
   - **Example**: `cursor.execute("SELECT * FROM students")` executes a `SELECT` statement to retrieve all rows from the `students` table.
   
   - **Common Use Cases**:
     - **SELECT** queries to retrieve data.
     - **INSERT**, **UPDATE**, or **DELETE** queries to modify data.
   
---

### **Summary of Methods:**
- **`cursor()`**: Creates a cursor object to interact with the database.
- **`execute()`**: Executes a given SQL query (such as SELECT, INSERT, UPDATE, DELETE).

## Q7. Give the order of execution of SQL clauses in an SQL query.

### **Order of Execution of SQL Clauses**

When you write an SQL query, the SQL clauses are processed in a specific order, even though they may be written in a different sequence in the query. Here is the correct order in which SQL clauses are executed:

1. **FROM**: 
   - The first clause that is processed. It specifies the table(s) from which data is to be retrieved.
   
2. **JOIN**: 
   - If any joins are involved, they are processed after the `FROM` clause, specifying how the tables should be combined.

3. **WHERE**: 
   - The `WHERE` clause filters records based on the condition(s) provided. It limits the rows returned by the query.
   
4. **GROUP BY**: 
   - After filtering the records, the `GROUP BY` clause groups rows that have the same values into summary rows, like finding the total of each group.

5. **HAVING**: 
   - This clause is used to filter records after the `GROUP BY` operation. It allows you to apply conditions to grouped records, just as `WHERE` is used to filter individual rows.

6. **SELECT**: 
   - The `SELECT` clause specifies the columns that are to be returned. This is processed after grouping.

7. **DISTINCT**: 
   - If you are using `DISTINCT`, it is applied after the `SELECT` clause to eliminate duplicate rows in the result.

8. **ORDER BY**: 
   - The `ORDER BY` clause sorts the result set based on one or more columns. This is processed after selecting and filtering the rows.

9. **LIMIT / OFFSET**: 
   - Finally, the `LIMIT` clause limits the number of rows returned, and `OFFSET` specifies where to begin retrieving rows from.

### **Example Query for Demonstration**:

In [ ]:
SELECT column1, SUM(column2)
FROM table_name
WHERE condition
GROUP BY column1
HAVING SUM(column2) > 100
ORDER BY column1 DESC
LIMIT 10;


### **Order of Execution**:
1. **FROM**: Identifies the table `table_name`.
2. **WHERE**: Filters records based on the `condition`.
3. **GROUP BY**: Groups the data by `column1`.
4. **HAVING**: Filters the grouped data where the sum of `column2` is greater than 100.
5. **SELECT**: Chooses the columns `column1` and the aggregated `SUM(column2)`.
6. **ORDER BY**: Sorts the result set by `column1` in descending order.
7. **LIMIT**: Limits the result to 10 rows.